<?php

  //Пространство имен для перечисления глобальных переменных
  namespace GLOBALS_VAR
  {
    const NAME_DB = "OurBudgetDB";

  }

  //Пространство имен для перечисления сообщений которые обрабатывает сервер
  namespace E_MESSAGEID
  {
    //0 - не используем ни когда
    const TEST_CONNECT_SERVER = 1; //Протестировать доступность сервера
    const CREATE_NEW_PROFILE = 2;  //Создать новый профиль пользователя
    //3 - не используем ни когда, она используется клиентами для теста сайта google.com
    const TEST_LOGIN = 4; //Проверяем не занят ли такой логин

  }


?>